[
  {
    "title": "SpaceAPI",
    "link": "http://space-api.herokuapp.com/docs",
    "description": "Read-only JSON API which provides data about space entities such as planets, satellites, comets. Most requests lead to a scrap from other websites like <a href=\"http://www.heavens-above.com\">Heavens Above</a> to make it easier fr developers to use their data. Built in Ruby with <a href=\"http://www.sinatrarb.com\">Sinatra</a>, sources are available on Github <a href=\"https://github.com/rhannequin/space-api\">rhannequin/space-api</a>."
  },
  {
    "title": "MeetForMeal",
    "link": "https://github.com/meet-for-meal/meetformeal",
    "description": "Annual school project, social network to meet people and eat with them. Allow to find people and restaurants according to hobbies and taste, add as friend, send messages, invite for lunch or dinner, and many. Built in Ruby with <a href=\"http://rubyonrails.org\">Ruby On Rails</a> and third-party APIs such as Google Maps and Foursquare. Nice test-covered with <a href=\"http://rspec.info\">RSpec</a>, <a href=\"https://github.com/jnicklas/capybara\">Capybara</a> and <a href=\"https://github.com/thoughtbot/factory_girl\">factory_girl</a>."
  },
  {
    "title": "Web Services",
    "link": "https://github.com/rhannequin/ws-docs",
    "description": "School project around REST, SOAP and web services. Made of 4 different projects: <ul><li><a href=\"https://github.com/2slow/ws-soap-server\">ws-soap-server</a> SOAP server in PHP</li><li><a href=\"https://github.com/Jagbomb/ws-rest-server\">ws-rest-server</a> REST XML API in <a href=\"http://nodejs.org\">NodeJS</a> with <a href=\"http://expressjs.com\">Express</a></li><li><a href=\"https://github.com/rhannequin/ws-app\">ws-app</a> main server-side part in Ruby with <a href=\"http://www.sinatrarb.com\">Sinatra</a></li><li><a href=\"https://github.com/rhannequin/ws-client\">ws-client</a> client-side HTML/JS webapp with <a href=\"http://gulpjs.com\">Gulp</a> and <a href=\"http://browserify.org\">Browserify</a></li></ul>"
  },
  {
    "title": "Ayouken bot",
    "link": "https://github.com/rhannequin/ayouken-api",
    "description": "Ayouken is a mix between a bot and an API. <a href=\"https://github.com/rhannequin/ayouken-api\">ayouken-api</a> is a JSON API which handle requests like displaying a tweet, getting a random gif or looking for documentation on <a href=\"https://developer.mozilla.org\">MDN</a>. I'm trying to build other projects to use this API to have a multi-plateform bot, like <a href=\"https://github.com/rhannequin/ayouken-gitter-client\">ayouken-gitter-client</a> for <a href\"https://gitter.im\">Gitter</a> or <a href=\"https://github.com/rhannequin/ayouken\">ayouken (former project)</a> as an IRC bot. <a href=\"https://github.com/rhannequin/ayouken-api\">ayouken-api</a> is built in Ruby with <a href=\"http://www.sinatrarb.com\">Sinatra</a>."
  },
  {
    "title": "Webapp generator",
    "link": "https://github.com/rhannequin/webapp-generator",
    "description": "This project is -<em>obviously</em>- a webapp generator, with the build system <a href=\"http://gulpjs.com\">Gulp</a>. It allows to benefit from a nice environment development with tasks like JavaScript linting, livereaload, asset pre-processing and many other. It also make some production tasks very easy like concat, uglify, image optimization."
  },
  {
    "title": "Labo Web ESGI",
    "link": "https://github.com/webdevesgi/labowebesgi",
    "description": "This project is the website of the school association I ruled for years. It was a development-oriented association in which we were able to discuss and present topics around web development. This websites made it easier to create and manage events for students. It was built in Ruby with <a href=\"http://rubyonrails.org\">Ruby On Rails</a> and is well test-covered."
  },
  {
    "title": "Stalkhub",
    "link": "https://github.com/rhannequin/stalkhub",
    "description": "Stalkhub is a project to easily retreive information from <a href=\"https://github.com\">Github</a> with are not directly available from the plateform. This idea comes from the fact that it can be hard to follow huge open-source projects. Watching issues and pull-requests doesn't make it easy to know what's really changing. Stalkhub can simplify this by showing the last commits of a project since the last visit. Other features are ready to be developed."
  },
  {
    "title": "Countdown Launch",
    "link": "https://github.com/rhannequin/countdown-launch",
    "description": "Countdown Launch is a very small and useless project. Its only purpose is to create and diplay a countdown for an event. I only made it to have fun with friends with coming dates and events. It was built in Ruby with <a href=\"http://rubyonrails.org\">Ruby On Rails</a>."
  },
  {
    "title": "Foursquare Hack",
    "link": "https://github.com/rhannequin/foursquare-hack",
    "description": "This is a small project based on <a href=\"https://developer.foursquare.com\">Foursquare API</a> to retreive restaurants around you. You can restrict the results by giving your own taste or kind of food you want. This was the first part of an idea which was later giving birth to <a href=\"https://github.com/meet-for-meal/meetformeal\">MeetForMeal</a>. It is only made of HTML, CSS and JavaScript."
  }
]
